IDEA Open Model
ConcreteSLSCheckResultStressLimitationEc2 Properties
Compatible with IDEA StatiCa v 10.1
The ConcreteSLSCheckResultStressLimitationEc2 type exposes the following members.
Properties
Name | Description
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
LimitStress
 type of SLS limit stress check
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Stress
 type of SLS limit stress check
TypeCheck
 type of SLS limit stress check
Top
See Also
Reference
ConcreteSLSCheckResultStressLimitationEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace